app/Controllers/Compras.php

SELECT *
FROM `compras`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $compras = $this->compras->where('activo',$activo)->findAll();

SELECT *
FROM `compras`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `detalle_compra`
WHERE `id_compra` = '2'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'
---
    function generaCompraPdf($id_compra){

        $datosCompra = $this->compras->where('id', $id_compra)->first();
        $detalleCompra = $this->detalle_compra->select('*')->where('id_compra', $id_compra)->findAll();

        $nombreTienda = $this->configuracion->select('valor')->where('nombre', 'tienda_nombre')->get()->getRow()->valor;
        $direccionTienda = $this->configuracion->select('valor')->where('nombre', 'tienda_direccion')->get()->getRow()->valor;