app/Controllers/Inicio.php

    public function index()
    {
        $totalProductos     = $this->productoModel->totalProductos();
        $totalVentas        = $this->ventasModel->totalDia(date('Y-m-d'));
        $NumeroVentas       = $this->ventasModel->VentaDia(date('Y-m-d')); //año-mes-dia
        $minimos            = $this->productoModel->productosMinimo();

        $productosnombre = $this->productoModel->where('activo',1)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1