app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo',$activo)->findAll();

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function generaBarras(){

        $pdf = new \FPDF('P', 'mm', 'letter');
        $pdf -> AddPage();
        $pdf -> SetTitle("Codigos de barras");

        $productos = $this->productos->where('activo', 1)->findAll();