app/Controllers/Ventas.php

    function generaTicket($id_venta){

        $datosVenta = $this->ventas->where('id', $id_venta)->first();
        $detalleVenta = $this->detalle_venta->select('*')->where('id_venta', $id_venta)->findAll();

        $nombreTienda    = $this->configuracion->select('valor')->where('nombre', 'tienda_nombre')->get()->getRow()->valor;
---
SELECT *
FROM `ventas`
WHERE `id` = '3'
 LIMIT 1
SELECT *
FROM `detalle_venta`
WHERE `id_venta` = '3'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'ticket_leyenda'