app/Models/VentasModel.php

SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '2022-12-29'
---
    public function VentaDia($fecha){
        $where = "activo = 1 AND DATE(fecha_alta) = '$fecha'";
        return $this->where($where)->countAllResults();

SELECT sum(total) AS total
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '2022-12-29'
 LIMIT 1
---
    public function totalDia($fecha){
        $this->select("sum(total) AS total");
        $where = "activo = 1 AND DATE(fecha_alta) = '$fecha'";
        return $this->where($where)->first();